Repository: StorageB/custom-command-toggle
Catalog: po/*.po
Languages: it, nl

source: What's New
it: Novità
nl: Wijzigingslog

source: GitHub Page
it: Pagina GitHub
nl: GitHub-pagina

source: Extension Page
it: Pagina dell'estensione
nl: Extensiepagina

source: User Guide
it: Guida utente
nl: Handleiding

source: Discussions
it: Discussioni
nl: Discussies

source: Settings exported to: %s
it: Impostazioni esportate in: %s
nl: De voorkeuren zijn geëxporteerd naar %s

source: Open
it: Apri
nl: Openen

source: Application Not Found
it: Applicazione non trovata
nl: Toepassing niet aangetroffen

source: No default application found to open .ini files. The toggles.ini file can be opened and modified in any text editor. To open the file, it may first be required to manually associate the .ini file with the default text editor by doing the following: 1. Open the home directory and locate the toggles.ini file 2. Right-click on the file and select "Open with..." 3. Choose a default text editor, and select the option "Always use for this file type"
it: Nessuna applicazione predefinita trovata per aprire i file .ini. Il file toggles.ini può essere aperto e modificato con qualsiasi editor di testo. Per aprire il file, potrebbe essere necessario associare manualmente il file .ini all'editor di testo predefinito procedendo come segue: 1. Apri la directory home e individua il file toggles.ini 2. Fai clic destro sul file e seleziona "Apri con..." 3. Scegli un editor di testo predefinito e seleziona l'opzione "Usa sempre per questo tipo di file"
nl: Er is geen standaardtoepassing voor het openen van .ini-bestanden. Het toggles.ini-bestand kan met iedere tekstbewerker worden geopend en bewerkt. Hiervoor kan het noodzakelijk zijn om .ini-bestanden toe te wijzen aan de tekstbewerker. Dit kan als volgt: 1. Open uw persoonlijke map en zoek het toggles.ini-bestand; 2. Klik met de rechtermuisknop op het bestand en kies ‘Openen met…’; 3. Kies de standaard tekstbewerker en geef aan dat dit soort bestandstypen er altijd mee moeten worden geopend.

source: Export Error
it: Errore di esportazione
nl: Exportfout

source: Details
it: Dettagli

source: Failed to export settings %s
it: Impossibile esportare le impostazioni %s
nl: De voorkeuren kunnen niet worden geëxporteerd %s

source: File not found
it: File non trovato
nl: Bestand niet aangetroffen

source: File Not Found
it: File non trovato
nl: Bestand niet aangetroffen

source: The %s configuration file was not found in the user's home directory. Verify the following file exists: %s
it: Il file di configurazione %s non è stato trovato nella directory home dell'utente. Verifica che il seguente file esista: %s
nl: Het %s-voorkeurenbestand is niet aangetroffen in de persoonlijke map. Controleer of het volgende bestand bestaat: %s

source: Import Error
it: Errore di importazione
nl: Importfout

source: Failed to import configuration %s
it: Impossibile importare la configurazione %s
nl: De voorkeuren kunnen niet worden geïmporteerd %s

source: My Button
it: Il mio pulsante
nl: Mijn knop

source: No toggles found in %s.
it: Nessun interruttore trovato in %s.
nl: Er zijn geen schakelaars aangetroffen in %s.

source: Successfully imported %d toggle
it: Importato con successo %d interruttore
nl: Er is %d schakelknop geïmporteerd

source: All settings reset to defaults
it: Tutte le impostazioni ripristinate ai valori predefiniti
nl: Alle standaardwaarden zijn teruggezet

source: Failed to reset settings
it: Impossibile ripristinare le impostazioni
nl: De standaardwaarden kunnen niet worden teruggezet

source: Set a keyboard shortcut for toggle button
it: Imposta una scorciatoia da tastiera per il pulsante interruttore
nl: Wijs een sneltoets toe aan deze schakelaar

source: Not assigned
it: Non assegnato
nl: Niet toegewezen

source: Press Esc to cancel or Backspace to disable the shortcut
it: Premi Esc per annullare o Backspace per disabilitare la scorciatoia
nl: Druk op escape of backspace om de sneltoets uit te schakelen

source: Icon List
it: Elenco icone
nl: Pictogrammenlijst

source: About
it: Informazioni
nl: Over

source: Help and resources
it: Aiuto e risorse
nl: Hulp en bronnen

source: Toggle Button
it: Pulsante interruttore
nl: Schakelaar

source: Button %d
it: Pulsante %d
nl: Schakelaar %d

source: Appearance
it: Aspetto
nl: Vormgeving

source: Hide this toggle
it: Nascondi questo interruttore
nl: Schakelaar verbergen

source: Show this toggle
it: Mostra questo interruttore
nl: Schakelaar tonen

source: Button name:
it: Nome pulsante:
nl: Naam van schakelaar:

source: Icon:
it: Icona:
nl: Pictogram:

source: Commands
it: Comandi
nl: Opdrachten

source: Toggle ON Command:
it: Comando su attivazione:
nl: AAN-opdracht:

source: Toggle OFF Command:
it: Comando su disattivazione:
nl: UIT-opdracht:

source: Check Status Command:
it: Comando verifica stato:
nl: Statuscontroleopdracht:

source: Check Status Search Term:
it: Termine di ricerca verifica stato:
nl: Trefwoord(en) binnen statuscontrole:

source: Startup Behavior
it: Comportamento all'avvio
nl: Opstartgedrag

source: On
it: Attivo
nl: Aan

source: Off
it: Disattivo
nl: Uit

source: Previous state
it: Stato precedente
nl: Vorige status

source: Command output
it: Output del comando
nl: Opdrachtuitvoer

source: Initial State
it: Stato iniziale
nl: Initiële status

source: State of the toggle button at login/startup
it: Stato del pulsante interruttore all'accesso/avvio
nl: De status van de schakelaar na aanmelden/opstarten

source: Command Configuration
it: Configurazione comandi
nl: Opdrachtvoorkeuren

source: Enter the Check Status Command and Search Term in the Commands section above. If the specified Search Term appears in the command's output, the button will be set to ON at startup. Otherwise, the button will be set to OFF.
it: Inserisci il Comando verifica stato e il Termine di ricerca nella sezione Comandi sopra. Se il Termine di ricerca specificato appare nell'output del comando, il pulsante verrà impostato su ATTIVO all'avvio. Altrimenti, il pulsante verrà impostato su DISATTIVO.
nl: Voer de statusopdracht en trefwoord(en) in, in bovenstaande opdrachtensectie. Als de zoekopdracht voorkomt in de uitvoer, zal de knop worden aangezet, anders niet.

source: Run Command at Startup
it: Esegui comando all'avvio
nl: Opdracht uitvoeren na opstarten

source: Run associated toggle command at login/startup
it: Esegui il comando associato all'interruttore all'accesso/avvio
nl: Voer de toegewezen opdracht uit na aanmelden/opstarten

source: Startup Delay (seconds)
it: Ritardo avvio (secondi)
nl: Opstartvertraging (in seconden)

source: Amount of time to delay command from running after startup
it: Tempo di attesa prima dell'esecuzione del comando dopo l'avvio
nl: De wachttijd alvorens de opdracht uit te voeren

source: Toggle Behavior
it: Comportamento interruttore
nl: Schakelaargedrag

source: Always on
it: Sempre attivo
nl: Altijd aan

source: Always off
it: Sempre disattivo
nl: Altijd uit

source: Toggle
it: Alterna
nl: Schakelaar

source: Button Click Action
it: Azione al clic del pulsante
nl: Klikactie

source: Button behavior when clicked
it: Comportamento del pulsante al clic
nl: De actie na aanklikken van de schakelaar

source: Check Command Exit Code
it: Verifica codice di uscita del comando
nl: Afsluitcode van controleopdracht

source: Only toggle if the command executes successfully (returns exit code 0)
it: Alterna solo se il comando viene eseguito con successo (restituisce codice di uscita 0)
nl: Alleen uitvoeren als de opdracht foutloos is uitgevoerd (afsluitcode 0)

source: Show Indicator Icon
it: Mostra icona dell'indicatore
nl: Indicator tonen

source: Show top bar icon when toggle button is switched on
it: Mostra l'icona nella barra superiore quando il pulsante interruttore è attivo
nl: Toon een pictogram op de bovenbalk als de schakelaar aanstaat

source: Close Menu After Button Press
it: Chiudi menu dopo la pressione del pulsante
nl: Menu sluiten na aanklikken van schakelaar

source: Close the system menu immediately after clicking toggle button
it: Chiudi immediatamente il menu di sistema dopo aver cliccato il pulsante interruttore
nl: Sluit het systeemmenu na aanklikken van de schakelaar

source: Command Sync Behavior
it: Comportamento sincronizzazione comando
nl: Opdrachtsynchronisatie

source: Keep Toggle State Synced
it: Mantieni lo stato dell'interruttore sincronizzato
nl: Status gesynchroniseerd houden

source: Keep toggle button state synced with a command's output
it: Mantieni lo stato del pulsante interruttore sincronizzato con l'output di un comando
nl: Houdt de schakelaarstatus synchroon met de opdrachtuitvoer

source: Enter the Check Status Command and Search Term in the Commands section above. If the specified Search Term appears in the command's output, the button will be set to ON. Otherwise, the button will be set to OFF.
it: Inserisci il Comando verifica stato e il Termine di ricerca nella sezione Comandi sopra. Se il Termine di ricerca specificato appare nell'output del comando, il pulsante verrà impostato su ATTIVO. Altrimenti, il pulsante verrà impostato su DISATTIVO.
nl: Voer de statusopdracht en trefwoord(en) in, in bovenstaande opdrachtensectie. Als de zoekopdracht voorkomt in de uitvoer, zal de knop worden aangezet, anders niet.

source: Polling Frequency (seconds)
it: Frequenza di polling (secondi)
nl: Controlefrequentie (in seconden)

source: How often to check the command output and update button state
it: Frequenza di verifica dell'output del comando e aggiornamento dello stato del pulsante
nl: Hoe vaak de opdrachtuitvoer en schakelaarstatus dienen te worden gecontroleerd

source: Command sync is disabled. To enable, set the Button Click Action to Toggle.
it: La sincronizzazione dei comandi è disabilitata. Per attivarla, imposta l'Azione al click del pulsante su Alterna.
nl: Opdrachtsynchronisatie is uitgeschakeld. Stel de klikactie in om dit in te schakelen.

source: Keyboard Shortcut
it: Scorciatoia da tastiera
nl: Sneltoets

source: Assign Shortcut
it: Assegna scorciatoia
nl: Sneltoets toewijzen

source: Configuration
it: Configurazione
nl: Voorkeuren

source: Settings
it: Impostazioni
nl: Voorkeuren

source: Number of Toggle Buttons
it: Numero di pulsanti interruttore
nl: Aantal schakelaars

source: Click Apply to save and reinitialize toggle states
it: Clicca Applica per salvare e reinizializzare gli stati dell'interruttore
nl: Klik op toepassen om op te slaan en alle statussen opnieuw te controleren

source: Apply
it: Applica
nl: Toepassen

source: Backup and Restore
it: Backup e ripristino
nl: Reservekopie en herstel

source: Import Configuration
it: Importa configurazione
nl: Voorkeuren importeren

source: Click to import the toggles.ini configuration file from the home directory
it: Clicca per importare il file di configurazione toggles.ini dalla directory home
nl: Klik om het toggles.ini-voorkeurenbestand te importeren uit de persoonlijke map

source: Export Configuration
it: Esporta configurazione
nl: Voorkeuren exporteren

source: Click to export the toggles.ini configuration file to the home directory
it: Clicca per esportare il file di configurazione toggles.ini nella directory home
nl: Klik om het toggles.ini-voorkeurenbestand te exporteren naar de persoonlijke map

source: Advanced
it: Avanzate
nl: Geavanceerd

source: Detailed Logging
it: Log dettagliato
nl: Uitgebreid logboek aanleggen

source: To view output, run the following in a terminal then restart extension: %s
it: Per visualizzare l'output, esegui il seguente comando in un terminale e riavvia l'estensione: %s
nl: Bekijk de uitvoer door het volgende uit te voeren in een terminalvenster en de extensie te herstarten: %s

source: Copy command to clipboard
it: Copia comando negli appunti
nl: Opdracht kopiëren naar klembord

source: Command copied to clipboard
it: Comando copiato negli appunti
nl: De opdracht is gekopieerd naar het klembord

source: Reset to Defaults
it: Ripristina predefiniti
nl: Standaardwaarden herstellen

source: Click to restore all toggles and settings to their default values
it: Clicca per ripristinare tutti gli interruttori e le impostazioni ai valori predefiniti
nl: Klik om alle standaardwaarden van schakelaars en voorkeuren terug te zetten

source: Confirm Reset
it: Conferma ripristino
nl: Herstel bevestigen

source: All toggles and extension settings will be reset to their default values. This action cannot be undone.
it: Tutti gli interruttori e le impostazioni dell'estensione verranno ripristinati ai valori predefiniti. Questa azione non può essere annullata.
nl: Alle schakelaars en voorkeuren worden teruggezet op de standaardwaarden. Deze actie is onomkeerbaar.

source: Cancel
it: Annulla
nl: Annuleren

source: Reset
it: Ripristina
nl: Standaardwaarden

source: Resources
it: Risorse
nl: Bronnen

source: Find links to the User Guide, Icon List, and other helpful information in the menu at the top of this window.
it: Trova i link alla Guida utente, all'Elenco icone e ad altre informazioni utili nel menu in cima a questa finestra.
nl: Links naar de handleiding, pictogrammenlijst en andere nuttige informatie is te vinden in het menu bovenaan het venster.

source: OK
nl: Oké
